#include <stdio.h>
#include <string.h>


#define NIL "null"

/*
	names本质是char的二维数组，
	可以认为names中存放的是元素为char[16]的以为数组，而char[16]就是字符串的存储空间。
	该操作称为names数组的初始化，其字符数组的内存布局为以下描述，
	地址为连续分配。可以进行修改。
	-------------------------------------------------
	|z |u |c |h |u |n |l |e |i |\0|\0|\0|\0|\0|\0|\0|
	-------------------------------------------------
	|n |a |w |a |w |a |\0|\0|\0|\0|\0|\0|\0|\0|\0|\0|
	-------------------------------------------------
	|n |u |l |l |\0|\0|\0|\0|\0|\0|\0|\0|\0|\0|\0|\0|
	-------------------------------------------------
	其中sizeof(names)为3*16 = 48字节。
*/
char names[][16] = {
	"zuchunlei",
	"nawawa",
	NIL
};

/*
	strings本质是一维数组，其元素为char *。所以说strings本质是指向char类型指针的数组。
	该操作称为strings的分配，和前面的数组初始化完全不同。strings的内存布局为：
	-----------
	|0xXXXXXXX|----------->  z u c h u n l e i \0
	-----------
	|0xXXXXXXX|----------->  n a w a w a \0
	-----------
	|0xXXXXXXX|----------->  n u l l \0
	-----------

	其中"zuchunlei"称为字符串字面量，在编译期间其存储地址已经确定。存放在.rodata中，并且运行期不可修改。
	其中sizeof(strings)为3*4 = 12字节。

*/
char *strings[] = {
	"zuchunlei",
	"nawawa",
	NIL
};



